In [8]:
import numpy as np
import pandas as pd
import datetime
from datetime import date

In [9]:
NaN = np.nan

In [10]:
# Creating dataframe with random dates
date_1 =['2019-01-24','2019-01-12','2018-12-18',NaN,'2018-09-21','2017-12-21']
date_2 =['2019-01-28','2018-01-12',NaN,'2016-12-18','2017-09-21','2015-12-21']
salary = [45000,12000,80000,32000,60000,25000]

In [11]:
df = pd.DataFrame(dict(Start_date=date_2,End_date=date_1,Salary=salary))

In [12]:
df

   Start_date    End_date  Salary
0  2019-01-28  2019-01-24   45000
1  2018-01-12  2019-01-12   12000
2         NaN  2018-12-18   80000
3  2016-12-18         NaN   32000
4  2017-09-21  2018-09-21   60000
5  2015-12-21  2017-12-21   25000

In [13]:
df.isnull().any()

Start_date     True
End_date       True
Salary        False
dtype: bool

In [14]:
df = df.dropna()
df

   Start_date    End_date  Salary
0  2019-01-28  2019-01-24   45000
1  2018-01-12  2019-01-12   12000
4  2017-09-21  2018-09-21   60000
5  2015-12-21  2017-12-21   25000

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 5
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Start_date  4 non-null      object
 1   End_date    4 non-null      object
 2   Salary      4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 128.0+ bytes

In [16]:
df.columns

Index(['Start_date', 'End_date', 'Salary'], dtype='object')

In [17]:
for col in df.columns:
    if df[col].dtype == 'object':
        try:
            df[col] = pd.to_datetime(df[col])
        except ValueError:
            pass

C:\Users\h.p\anaconda3\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 5
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Start_date  4 non-null      datetime64[ns]
 1   End_date    4 non-null      datetime64[ns]
 2   Salary      4 non-null      int64
dtypes: datetime64[ns](2), int64(1)
memory usage: 128.0 bytes

In [19]:
date_col = []
for col in df.columns:
    if df[col].dtype=='datetime64[ns]':
        date_col.append(col)

In [32]:
date_col

['Start_date', 'End_date']

In [44]:
for i in range(len(date_col)):
    df[f'difference{i}'] = df[date_col[i]]-df[date_col[i-1]]

C:\Users\h.p\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [67]:
df[date_col[0]]-df[date_col[1]]

0      4 days
1   -365 days
2         NaT
3         NaT
4   -365 days
5   -731 days
dtype: timedelta64[ns]

In [45]:
df

,Start_date,End_date,Salary,Difference,column0,difference,difference0,difference1
0,2019-01-28,2019-01-24,45000,4 days,-4 days,4 days,4 days,-4 days
1,2018-01-12,2019-01-12,12000,-365 days,365 days,-365 days,-365 days,365 days
4,2017-09-21,2018-09-21,60000,-365 days,365 days,-365 days,-365 days,365 days
5,2015-12-21,2017-12-21,25000,-731 days,731 days,-731 days,-731 days,731 days